modules/admin/controllers/AdsController.php

SELECT * FROM `products` WHERE `status_id` IN ('2', '3')
---
    public function actionIndex()
    {
        $searchModel = new AdsSearch();
        $dataProvider = $searchModel->search(Yii::$app->request->queryParams);

        $product = ArrayHelper::map(Product::find()->where(['IN', 'status_id', [ProductStatus::STATUS_APPROVED, ProductStatus::STATUS_IN_STOCK]])->all(), 'id', 'name');

SELECT * FROM `products` WHERE `status_id` IN ('2', '3')
---
    public function actionCreate()
    {
        $model = new Ads();
        $model->scenario = Ads::SCENARIO_CREATE;
        $ad_image = UploadedFile::getInstance($model, 'image');

        $category = ArrayHelper::map(ProductCategory::find()->where(['parent_category_id' => null])->andWhere(['IN', 'status', [ProductCategory::STATUS_APPROVE]])->all(), 'id', 'name');
        $subCategory = ArrayHelper::map(ProductCategory::find()->where(['>', 'parent_category_id', 0])->andWhere(['IN', 'status', [ProductCategory::STATUS_APPROVE]])->all(), 'id', 'name');
        $product = ArrayHelper::map(Product::find()->where(['IN', 'status_id', [ProductStatus::STATUS_APPROVED, ProductStatus::STATUS_IN_STOCK]])->all(), 'id', 'name');

SELECT * FROM `products` WHERE `status_id` IN ('2', '3')
---
    public function actionUpdate($id)
    {
        $model = $this->findModel($id);
        $old_image = $model->image;

        $category = ArrayHelper::map(ProductCategory::find()->where(['parent_category_id' => null])->andWhere(['IN', 'status', [ProductCategory::STATUS_APPROVE]])->all(), 'id', 'name');
        $subCategory = ArrayHelper::map(ProductCategory::find()->where(['>', 'parent_category_id', 0])->andWhere(['IN', 'status', [ProductCategory::STATUS_APPROVE]])->all(), 'id', 'name');
        $product = ArrayHelper::map(Product::find()->where(['IN', 'status_id', [ProductStatus::STATUS_APPROVED, ProductStatus::STATUS_IN_STOCK]])->all(), 'id', 'name');