modules/admin/controllers/UserController.php

SELECT * FROM `user_addresses` WHERE (`user_id`='1') AND (`type`='3')
---
    public function actionView($id)
    {
        $userShopAddress = UserAddress::find()->where(['user_id' => $id, 'type' => UserAddress::TYPE_SHOP])->one();