modules/api/v2/models/Login.php

SELECT * FROM `user_device` WHERE (`notification_token`='740f4707bebcf74f9b7c25d48e3358945f6aa01da5ddb387462c7eaf 61bb78ad') AND (`device_platform`='ios') AND (`user_id`=218)
---
                Yii::$app->request->post('notification_token');
                Yii::$app->request->post('device_platform');

                $modelDevice = UserDevice::find()->where(['notification_token' => Yii::$app->request->post('notification_token'), 'device_platform' => Yii::$app->request->post('device_platform'), 'user_id' => $this->_user->id])->one();

SELECT * FROM `users` WHERE (`email`='sugney.cmarix@gmail.com') AND (`user_type`=3)
---
    public function getUser($loginFrom = null)
    {
        if ($this->_user === false && empty($loginFrom)) {
            //$this->_user = User::findByEmail($this->email);
            $this->_user = User::find()->where(['email' => $this->email, 'user_type' => User::USER_TYPE_NORMAL])->one();