modules/api/v2/controllers/UserController.php


            //update notification token
            if (!empty($postData['notification_token']) && !empty($postData['device_platform']) && !empty(Yii::$app->user->identity->id)) {
                $loginDevice = UserDevice::find()->where(['notification_token' => $postData['notification_token'], 'device_platform' => $postData['device_platform'], 'user_id' => Yii::$app->user->identity->id])->one();
---
SELECT * FROM `user_device` WHERE (`notification_token`='740f4707bebcf74f9b7c25d48e3358945f6aa01da5ddb387462c7eaf 61bb78ad') AND (`device_platform`='ios') AND (`user_id`=218)