models/Brand.php

    public function isBrandOfTheWeek($brandId)
    {
        $brandFromDate = date("Y-m-d 00:00:01", strtotime('-1 week'));
        $brandToDate = date("Y-m-d 23:59:59");
        $query1 = Brand::find();

        $query1->innerJoin('products', 'products.brand_id="' . $brandId . '"');
        $query1->leftjoin('order_items', 'order_items.product_id=products.id');
        $query1->rightjoin('orders', 'orders.id=order_items.order_id');
        $query1->select(['SUM(order_items.quantity) AS total_sold_product', 'products.brand_id']);
        $query1->where(['products.brand_id' => $brandId]);
        $subQuery = $query1->where(['between', 'order_items.created_at', $brandFromDate, $brandToDate])->andWhere(['orders.status' => Order::STATUS_ORDER_COMPLETED])->asArray()->one();
---
SELECT SUM(order_items.quantity) AS `total_sold_product`, `products`.`brand_id` FROM `brands` INNER JOIN `products` ON products.brand_id="11" LEFT JOIN `order_items` ON order_items.product_id=products.id RIGHT JOIN `orders` ON orders.id=order_items.order_id WHERE (`order_items`.`created_at` BETWEEN '2021-08-30 00:00:01' AND '2021-09-06 23:59:59') AND (`orders`.`status`='3')